
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10345550722)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> "functions/src_88dbf1db8b15e3f77c76c3cf1037880a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> "functions/src_88dbf1db8b15e3f77c76c3cf1037880a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> "functions/src_88dbf1db8b15e3f77c76c3cf1037880a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "wG41Dg==" -> (known after apply)
      ~ detect_md5hash      = "FB+sI+EWHHpTuSgNyVed6Q==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "FB+sI+EWHHpTuSgNyVed6Q==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_141fac23e1161c7a53b9280dc9579de9.zip?generation=1723159050194893&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> "functions/src_88dbf1db8b15e3f77c76c3cf1037880a.zip" # forces replacement
      ~ output_name         = "functions/src_141fac23e1161c7a53b9280dc9579de9.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_141fac23e1161c7a53b9280dc9579de9.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1217,"Program":"tfcmt","SHA1":"528c1b234f03d5645931a5da1cb605f7a8f09bf0","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->